app/views/jobs/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.select :user_id, User.all.pluck(:name,:id)%>
---
SELECT "users"."name", "users"."id" FROM "users"