app/controllers/cars_controller.rb

INSERT INTO "cars" ("user_id", "carname", "carcolor", "carnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["carname", "bmw"], ["carcolor", "black"], ["carnumber", 1234], ["created_at", "2022-11-03 18:02:16.192620"], ["updated_at", "2022-11-03 18:02:16.192620"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "carnumber" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["carnumber", nil], ["updated_at", "2022-11-08 18:54:36.602684"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)