app/controllers/clints_controller.rb

  def index
  phones = params.fetch(:phones, nil)
  @clints = Clint.with_phones(phones).all
---
SELECT "clints"."id" FROM "clints"
SELECT "phones".* FROM "phones" WHERE "phones"."clint_id" = ?  [["clint_id", 1]]