app/models/clint.rb

SELECT "phones".* FROM "phones"
---
  scope :with_phones, ->(include) { includes(:phones) if include.present?  && include.to_bool}